class script(object):
    START_TXT = """<b>Hᴇʟʟᴏ 
Sᴏʀʀʏ ɪ ᴏɴʟʏ ᴡᴏʀᴋ ᴏɴ ғɪʟᴍ ʜᴏᴜꜱᴇ Gʀᴏᴜᴘ. Nᴏ ᴏᴛʜᴇʀ ᴄᴏᴍᴍᴀɴᴅ ᴡɪʟʟ ᴡᴏʀᴋ ᴏɴ ᴛʜɪs ʙᴏᴛ ᴇxᴄᴇᴘᴛ sᴛᴀʀᴛ. ᴅᴏɴ’ᴛ ᴡᴀsᴛᴇ ʏᴏᴜʀ ᴛɪᴍᴇ</b>"""
    HELP_TXT = """<b> Tʜɪꜱ ɪꜱ ᴍʏ ʜᴇʟᴘ ᴄᴏᴍᴍᴀɴᴅꜱ</b>"""
    ABOUT_TXT = """🤖 ʙᴏᴛ ɴᴀᴍᴇ: {}
    
📝 ʟᴀɴɢᴜᴀɢᴇ : ᴘʏᴛʜᴏɴ

📚 ꜰʀᴀᴍᴇᴡᴏʀᴋ : ᴘʏʀᴏɢʀᴀᴍ

📡 ʜᴏsᴛᴇᴅ ᴏɴ : ʜᴇʀᴏᴋᴜ

👨‍💻 ᴅᴇᴠᴇʟᴏᴘᴇʀ :  ᴀᴅɪᴛʜ ᴛɢ 🇮🇳

💡 sᴏᴜʀᴄᴇ ᴄᴏᴅᴇ : ᴄʟɪᴄᴋ ʜᴇʀᴇ

👥 sᴜᴘᴘᴏʀᴛ ɢʀᴏᴜᴘ : ʀᴇxɪᴇ sᴜᴘᴘᴏʀᴛ

📢 ᴜᴘᴅᴀᴛᴇs ᴄʜᴀɴɴᴇʟ : ᴍʜ ᴜᴘᴅᴀᴛᴇs

🔖 𝑸𝒖𝒐𝒕𝒆 : ആരും പേടിക്കേണ്ട എല്ലാവർക്കും കിട്ടും"""
    SOURCE_TXT = """<b>NOTE:</b>
- Eva Maria is a open source project. 
- Source - https://github.com/EvamariaTG/EvaMaria  

<b>DEVS:</b>
- <a href=https://t.me/TeamEvamaria>Team Eva Maria</a>"""
    MANUELFILTER_TXT = """<b>🔧 ᴍᴀɴᴜᴀʟ ғɪʟᴛᴇʀ</b>

Fɪʟᴛᴇʀ ɪꜱ ᴛʜᴇ ғᴇᴀᴛᴜʀᴇ ᴡᴇʀᴇ ᴜꜱᴇʀꜱ ᴄᴀɴ ꜱᴇᴛ ᴀᴜᴛᴏᴍᴀᴛᴇᴅ ʀᴇᴘʟɪᴇꜱ ғᴏʀ ᴀ ᴘᴀʀᴛɪᴄᴜʟᴀʀ ᴋᴇʏᴡᴏʀᴅ ᴀɴᴅ EᴠᴀMᴀʀɪᴀ ᴡɪʟʟ ʀᴇꜱᴘᴏɴᴅ ᴡʜᴇɴᴇᴠᴇʀ ᴀ ᴋᴇʏᴡᴏʀᴅ ɪꜱ ғᴏᴜɴᴅ ᴛʜᴇ ᴍᴇꜱꜱᴀɢᴇ

<b>📚 ᴀᴠᴀɪʟᴀʙʟᴇ ᴄᴏᴍᴍᴀɴᴅꜱ</b>

• /ғɪʟᴛᴇʀ - ᴀᴅᴅ ᴀ ғɪʟᴛᴇʀ ɪɴ ᴄʜᴀᴛ
• /ғɪʟᴛᴇʀꜱ - ʟɪꜱᴛ ᴀʟʟ ᴛʜᴇ ғɪʟᴛᴇʀꜱ ᴏғ ᴀ ᴄʜᴀᴛ
• /ᴅᴇʟ - ᴅᴇʟᴇᴛᴇ ᴀ ꜱᴘᴇᴄɪғɪᴄ ғɪʟᴛᴇʀ ɪɴ ᴄʜᴀᴛ
• /ᴅᴇʟᴀʟʟ - ᴅᴇʟᴇᴛᴇ ᴛʜᴇ ᴡʜᴏʟᴇ ғɪʟᴛᴇʀꜱ ɪɴ ᴀ ᴄʜᴀᴛ (ᴄʜᴀᴛ ᴏᴡɴᴇʀ ᴏɴʟʏ)"""
    BUTTON_TXT = """<b>☎️ Bᴜᴛᴛᴏɴꜱ</b>

- Eᴠᴀ Mᴀʀɪᴀ Sᴜᴘᴘᴏʀᴛꜱ ʙᴏᴛʜ ᴜʀʟ ᴀɴᴅ ᴀʟᴇʀᴛ ɪɴʟɪɴᴇ ʙᴜᴛᴛᴏɴꜱ.

𝟷. Tᴇʟᴇɢʀᴀᴍ ᴡɪʟʟ ɴᴏᴛ ᴀʟʟᴏᴡꜱ ʏᴏᴜ ᴛᴏ ꜱᴇɴᴅ ʙᴜᴛᴛᴏɴꜱ ᴡɪᴛʜᴏᴜᴛ ᴀɴʏ ᴄᴏɴᴛᴇɴᴛ, ꜱᴏ ᴄᴏɴᴛᴇɴᴛ ɪꜱ ᴍᴀɴᴅᴀᴛᴏʀʏ.
𝟸. Eᴠᴀ Mᴀʀɪᴀ ꜱᴜᴘᴘᴏʀᴛꜱ ʙᴜᴛᴛᴏɴꜱ ᴡɪᴛʜ ᴀɴʏ ᴛᴇʟᴇɢʀᴀᴍ ᴍᴇᴅɪᴀ ᴛʏᴘᴇ.
𝟹. Bᴜᴛᴛᴏɴꜱ ꜱʜᴏᴜʟᴅ ʙᴇ ᴘʀᴏᴘᴇʀʟʏ ᴘᴀʀꜱᴇᴅ ᴀꜱ ᴍᴀʀᴋᴅᴏᴡɴ ғᴏʀᴍᴀᴛ"""
    AUTOFILTER_TXT = """Help: <b>🛠️ AUTO FILTER</b>

<b>NOTE:</b>
𝟷. Mᴀᴋᴇ ᴍᴇ ᴛʜᴇ ᴀᴅᴍɪɴ ᴏғ ʏᴏᴜʀ ᴄʜᴀɴɴᴇʟ ɪғ ɪᴛ'ꜱ ᴘʀɪᴠᴀᴛᴇ.
𝟸. ᴍᴀᴋᴇ ꜱᴜʀᴇ ᴛʜᴀᴛ ʏᴏᴜʀ ᴄʜᴀɴɴᴇʟ ᴅᴏᴇꜱ ɴᴏᴛ ᴄᴏɴᴛᴀɪɴꜱ ᴄᴀᴍʀɪᴘꜱ, ᴘᴏʀɴ ᴀɴᴅ ғᴀᴋᴇ ғɪʟᴇꜱ.
𝟹. Fᴏʀᴡᴀʀᴅ ᴛʜᴇ ʟᴀꜱᴛ ᴍᴇꜱꜱᴀɢᴇ ᴛᴏ ᴍᴇ ᴡɪᴛʜ ǫᴜᴏᴛᴇꜱ.
 I'ʟʟ ᴀᴅᴅ ᴀʟʟ ᴛʜᴇ ғɪʟᴇꜱ ɪɴ ᴛʜᴀᴛ ᴄʜᴀɴɴᴇʟ ᴛᴏ ᴍʏ ᴅʙ."""
    CONNECTION_TXT = """<b>🔗 Cᴏɴɴᴇᴄᴛɪᴏɴꜱ</b>

- Uꜱᴇᴅ ᴛᴏ ᴄᴏɴɴᴇᴄᴛ ʙᴏᴛ ᴛᴏ PM ғᴏʀ ᴍᴀɴᴀɢɪɴɢ ғɪʟᴛᴇʀꜱ 
- ɪᴛ ʜᴇʟᴘꜱ ᴛᴏ ᴀᴠᴏɪᴅ ꜱᴘᴀᴍᴍɪɴɢ ɪɴ ɢʀᴏᴜᴘꜱ.

𝟷. Oɴʟʏ ᴀᴅᴍɪɴꜱ ᴄᴀɴ ᴀᴅᴅ ᴀ ᴄᴏɴɴᴇᴄᴛɪᴏɴ.
𝟸. Sᴇɴᴅ /ᴄᴏɴɴᴇᴄᴛ ғᴏʀ ᴄᴏɴɴᴇᴄᴛɪɴɢ ᴍᴇ ᴛᴏ ᴜʀ PM

<b>📚 ᴀᴠᴀɪʟᴀʙʟᴇ ᴄᴏᴍᴍᴀɴᴅꜱ</b>

• /ᴄᴏɴɴᴇᴄᴛ - ᴄᴏɴɴᴇᴄᴛ ᴀ ᴘᴀʀᴛɪᴄᴜʟᴀʀ ᴄʜᴀᴛ ᴛᴏ ʏᴏᴜʀ PM
• /ᴅɪꜱᴄᴏɴɴᴇᴄᴛ - ᴅɪꜱᴄᴏɴɴᴇᴄᴛ ғʀᴏᴍ ᴀ ᴄʜᴀᴛ
• /ᴄᴏɴɴᴇᴄᴛɪᴏɴꜱ - ʟɪꜱᴛ ᴀʟʟ ʏᴏᴜʀ ᴄᴏɴɴᴇᴄᴛɪᴏɴꜱ"""
    EXTRAMOD_TXT = """<b>🎛 Exᴛʀᴀ Mᴏᴅᴜʟᴇꜱ</b>

ᴛʜᴇꜱᴇ ᴀʀᴇ ᴛʜᴇ ᴇxᴛʀᴀ ғᴇᴀᴛᴜʀᴇꜱ ᴏғ Eᴠᴀ Mᴀʀɪᴀ

<b>📚 ᴀᴠᴀɪʟᴀʙʟᴇ ᴄᴏᴍᴍᴀɴᴅꜱ</b>

• /ɪᴅ - ɢᴇᴛ ɪᴅ ᴏғ ᴀ ꜱᴘᴇᴄɪғɪᴇᴅ ᴜꜱᴇʀ.
• /ɪɴғᴏ - ɢᴇᴛ ɪɴғᴏʀᴍᴀᴛɪᴏɴ ᴀʙᴏᴜᴛ ᴀ ᴜꜱᴇʀ.
• /ɪᴍᴅʙ - ɢᴇᴛ ᴛʜᴇ ғɪʟᴍ ɪɴғᴏʀᴍᴀᴛɪᴏɴ ғʀᴏᴍ IMDʙ ꜱᴏᴜʀᴄᴇ.
• /ꜱᴇᴀʀᴄʜ - ɢᴇᴛ ᴛʜᴇ ғɪʟᴍ ɪɴғᴏʀᴍᴀᴛɪᴏɴ ғʀᴏᴍ ᴠᴀʀɪᴏᴜꜱ ꜱᴏᴜʀᴄᴇꜱ."""
    ADMIN_TXT = """<b>🧑‍💻 Aᴅᴍɪɴ ᴍᴏᴅꜱ</b>

Tʜɪꜱ ᴍᴏᴅᴜʟᴇ ᴏɴʟʏ ᴡᴏʀᴋꜱ ғᴏʀ ᴍʏ ᴀᴅᴍɪɴꜱ

<b>📚 ᴀᴠᴀɪʟᴀʙʟᴇ ᴄᴏᴍᴍᴀɴᴅꜱ</b>

• /ʟᴏɢꜱ - ᴛᴏ ɢᴇᴛ ᴛʜᴇ ʀᴇꜱᴄᴇɴᴛ ᴇʀʀᴏʀꜱ
• /ꜱᴛᴀᴛꜱ - ᴛᴏ ɢᴇᴛ ꜱᴛᴀᴛᴜꜱ ᴏғ ғɪʟᴇꜱ ɪɴ ᴅʙ.
• /ᴅᴇʟᴇᴛᴇ - ᴛᴏ ᴅᴇʟᴇᴛᴇ ᴀ ꜱᴘᴇᴄɪғɪᴄ ғɪʟᴇ ғʀᴏᴍ ᴅʙ.
• /ᴜꜱᴇʀꜱ - ᴛᴏ ɢᴇᴛ ʟɪꜱᴛ ᴏғ ᴍʏ ᴜꜱᴇʀꜱ ᴀɴᴅ ɪᴅꜱ.
• /ᴄʜᴀᴛꜱ - ᴛᴏ ɢᴇᴛ ʟɪꜱᴛ ᴏғ ᴛʜᴇ ᴍʏ ᴄʜᴀᴛꜱ ᴀɴᴅ ɪᴅꜱ 
• /ʟᴇᴀᴠᴇ  - ᴛᴏ ʟᴇᴀᴠᴇ ғʀᴏᴍ ᴀ ᴄʜᴀᴛ.
• /ᴅɪꜱᴀʙʟᴇ  -  ᴅᴏ ᴅɪꜱᴀʙʟᴇ ᴀ ᴄʜᴀᴛ.
• /ʙᴀɴ  - ᴛᴏ ʙᴀɴ ᴀ ᴜꜱᴇʀ.
• /ᴜɴʙᴀɴ  - ᴛᴏ ᴜɴʙᴀɴ ᴀ ᴜꜱᴇʀ.
• /ᴄʜᴀɴɴᴇʟ - ᴛᴏ ɢᴇᴛ ʟɪꜱᴛ ᴏғ ᴛᴏᴛᴀʟ ᴄᴏɴɴᴇᴄᴛᴇᴅ ᴄʜᴀɴɴᴇʟꜱ
• /ʙʀᴏᴀᴅᴄᴀꜱᴛ - ᴛᴏ ʙʀᴏᴀᴅᴄᴀꜱᴛ ᴀ ᴍᴇꜱꜱᴀɢᴇ ᴛᴏ ᴀʟʟ ᴜꜱᴇʀꜱ"""
    STATUS_TXT = """<b>╭─[ <a href=https://t.me/film_hous>ᴄɪɴᴇᴍᴀ ᴄᴏᴍᴘᴀɴʏ sᴛᴀᴛᴜs</a> ]──〄
│
├📁 ᴛᴏᴛᴀʟ ғɪʟᴇs ɪɴ ᴅʙ:  <code>{}</code>
│
├👤 ᴛᴏᴛᴀʟ ᴜsᴇʀs ɪɴ ᴅʙ:  <code>{}</code>
│
├👥 ᴛᴏᴛᴀʟ ɢʀᴏᴜᴘs :  <code>{}</code>
│
├🗃 ᴜsᴇᴅ sᴛᴏʀᴀɢᴇ :  <code>{}</code>
│
├🗄 ᴀᴠᴀɪʟᴀʙʟᴇ sᴛᴏʀᴀɢᴇ : <code>{}</code>
│
╰─[ <a href=https://t.me/film_hous>ᴄɪɴᴇᴍᴀ ᴄᴏᴍᴘᴀɴʏ sᴛᴀᴛᴜs</a> ]──〄</b>"""
    FILESTORE_TXT = """<b>🗃️ File Store</b>

<b>A ᴍᴏᴅᴜʟᴇ ᴛᴏ ꜱᴛᴏʀᴇ ғɪʟᴇꜱ ɪɴ ʙᴏᴛ ᴅᴀᴛᴀʙᴀꜱᴇ ɪɴ ꜱɪᴍᴘʟᴇ ᴍᴇᴛʜᴏᴅ<b>

<b>📚 ᴀᴠᴀɪʟᴀʙʟᴇ ᴄᴏᴍᴍᴀɴᴅꜱ</b>

• /ʙᴀᴛᴄʜ - ꜱᴀᴠᴇ ғɪʟᴇ ᴛᴏ Sʜᴀʀᴀʙʟᴇ ғɪʟᴇ
• /ᴘʙᴀᴛᴄʜ - ꜱᴀᴠᴇ ғɪʟᴇ ᴛᴏ ᴘʀᴏᴛᴇᴄᴛ ᴛᴏ ꜱʜᴀʀᴇ"""
    PERSONAL_TXT = """<b>എന്തായാലും സ്റ്റാർട്ട് അടിച്ചതല്ലെ ഇനി ആ താഴെ കാണുന്ന നമ്മുടെ ഒഫീഷ്യൽ ചന്നെൽ കൂടി Subscribe ചെയ്തിട്ട് പൊക്കോ...🤣🤣.</b>"""
    BEST_TXT = """<b> Tʜɪꜱ ɪꜱ ᴍʏ ʜᴇʟᴘ ᴄᴏᴍᴍᴀɴᴅꜱ</b>"""
    METTINGS_TXT = """<b>⚙️ ꜱᴇᴛᴛɪɴɢꜱ</b>

ᴛʜᴇꜱᴇ ᴀʀᴇ ᴛʜᴇ ꜱᴇᴛᴛɪɴɢꜱ ғᴇᴀᴛᴜʀᴇ ᴏғ ᴛʜɪꜱ ʙᴏᴛ ᴄᴀɴ ᴄᴏɴᴛʀᴏʟ ᴘᴍ

<b>📚 ᴀᴠᴀɪʟᴀʙʟᴇ ᴄᴏᴍᴍᴀɴᴅꜱ</b>

• /ꜱᴇᴛᴛɪɴɢꜱ - Tᴏ ᴄᴏɴᴛʀᴏʟ ɢʀᴏᴜᴘ ꜱᴇᴛᴛɪɴɢꜱ ᴛᴏ ʙᴏᴛ ᴘᴍ"""
    OWNER_TXT = """<b>⍟───[ ᴏᴡɴᴇʀ ᴅᴇᴛᴀɪʟꜱ ]───⍟
    
• ꜰᴜʟʟ ɴᴀᴍᴇ : Aᴅɪᴛʜ ᴀᴋ
• ᴜꜱᴇʀɴᴀᴍᴇ : @Brocklesnarqt
• ᴘᴇʀᴍᴀɴᴇɴᴛ ᴅᴍ ʟɪɴᴋ : <a href=https://t.me/my_devs>ᴄʟɪᴄᴋ ʜᴇʀᴇ</a></b>"""
    IDM_TEXT = """<b>🎪 Tɪᴛʟᴇ : {}</b>

┏ <b>🤴 ᴀsᴋᴇᴅ ʙʏ : {}</b>
┣ ⚡<b> ᴘᴏᴡᴇʀᴇᴅ ʙʏ : {}</b>
┗ 🍁<b> ᴄʜᴀɴɴᴇʟ : @film_housc</b>

<b><i>ᴛʜɪs ᴍᴀssᴀɢᴇ ᴀᴜᴛᴏᴍᴀᴛɪᴄᴀʟʟʏ ᴅᴇʟᴇᴛᴇ ᴀғᴛᴇʀ 𝟸𝟶 ᴍɪɴᴜᴛᴇs ᴛᴏ ᴀᴠᴏɪᴅ ᴄᴏᴘʏ ʀɪɢʜᴛ ɪssᴜᴇ</i></b>"""
    LOG_TEXT_G = """#NewGroup
Group = {}(<code>{}</code>)
Total Members = <code>{}</code>
Added By - {}
"""
    LOG_TEXT_P = """#NewUser
ID - <code>{}</code>
Name - {}
"""

    SPELL_CHECK_ENG = """
Google the correct movie name by clicking the Google Button or click on the button labeled yendex and find the correct movie name and enter it here Movie / Tv. Web Series will get ..

If you still do not get it. Movie Name & year after @admin. Example: Add @admin kala 2020 to the group in this way. The admin will upload within 24 hours

If you ask for a movie released in theaters, you will not get it, only if it is released on ott Dvd
"""
    SPELL_CHECK_MAL = """
Google, yendex എന്ന് എഴുതിയിരിക്കുന്ന ഏതെങ്കിലും ബട്ടണിൽ ക്ലിക്ക് ചെയ്ത് ശരിയായ സിനിമയുടെ പേര് കണ്ടെത്തി ഇവിടെ നൽകുക എന്നാലേ സിനിമ / Tv . Web സീരിയസ് കിട്ടുകയുള്ളു.. 

എന്നിട്ടും കിട്ടുന്നില്ല എങ്കിൽ. @admin ശേഷം മൂവി Name & year. Example : @admin kala 2020 ഈ രീതിയിൽ  ഗ്രൂപ്പിൽ സെന്റ് ചെയുക. 24 മണിക്കൂറിനുള്ളിൽ അഡ്മിൻ അപ്‌ലോഡ് ചെയ്യും

തിയേറ്ററിൽ റിലീസ് ആയ മൂവിയാണ് ചോദിച്ചതെങ്കിൽ കിട്ടില്ല ott Dvd റിലീസ് ആയാൽ മാത്രമേ കിട്ടുള്ളൂ
"""
    REQ_MOV = """<i>നിങ്ങൾ ആവശ്യപ്പെട്ട മൂവി എനിക്ക് എന്റെ ഡാറ്റാബേസിൽ നിന്നും കണ്ടെത്താൻ കഴിഞ്ഞില്ല ഈ മൂവി ഗ്രൂപ്പിൽ ആഡ് ചെയ്യാൻ വേണ്ടി മുകളിൽ കാണിച്ചതുപോലെ അഡ്മിൻ  മെൻഷൻ ചെയ്യുക</i>

<b>I Cᴀɴ'ᴛ Fɪɴᴅ Yᴏᴜʀ Rᴇǫᴜᴇsᴛᴇᴅ Mᴏᴠɪᴇ Iɴ Mʏ Dᴀᴛᴀʙᴀsᴇ . Pʟᴇᴀsᴇ Mᴇɴᴛɪᴏɴ Tʜᴀᴛ Mᴏᴠɪᴇ Nᴀᴍᴇ Tᴏ Gʀᴏᴜᴘ Aᴅᴍɪɴ</b>

<b>📮 Mᴇɴᴛɪᴏɴ ➪</b> <code>@admin Puzhu</code>"""

    CHK_MOV = """<i><b>Sᴏʀʀʏ I Cᴏᴜʟᴅɴ'ᴛ Fɪɴᴅ Aɴʏᴛʜɪɴɢ Rᴇʟᴀᴛᴇᴅ Tᴏ Tʜᴀᴛ Iɴ Mʏ Dᴀᴛᴀʙᴀsᴇ Pʟᴇᴀsᴇ Sᴇʟᴇᴄᴛ Yᴏᴜ Wᴀɴᴛ Mᴏᴠɪᴇ Bᴜᴛᴛᴏɴ Bᴇʟᴏᴡ 👇</b></i>"""
    
